{
  "title": "What Happened To The Mars Helicopter?",
  "author": "Veritasium",
  "video_id": "20vUNgRdB4o",
  "source_url": "https://www.youtube.com/watch?v=20vUNgRdB4o",
  "source_type": "youtube",
  "thumbnail_url": "https://i.ytimg.com/vi/20vUNgRdB4o/hqdefault.jpg",
  "html": "<iframe width=\"200\" height=\"113\" src=\"https://www.youtube.com/embed/20vUNgRdB4o?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"What Happened To The Mars Helicopter?\"></iframe>",
  "width": 200,
  "height": 113,
  "transcript": "427 days into what should have been a 30-day mission, and it's turned into a nightmare.\nOn the surface of Mars, 297 million kilometers away is Ingenuity, a tiny 680 gram helicopter.\nIt's made from off-the-shelf parts you'd find at home.\nIt's got bits from an Android smartphone, batteries from a cordless drill, and to everyone's surprise, it's been performing well so far.\nBut something is wrong.\nSee, the Martian winter is coming.\nAt night, temperatures plummet to a frigid negative 85 degrees celsius.\nAs Mars gets further away from the sun, the temperature keeps dropping, and it kicks up more and more violent dust.\nThe sun is blotted from the sky.\nOn her 427th day on Mars, they try to reach her, just like the day before, but they get no response.\nThey try again, nothing.\nBack on Earth the team gathers at the Jet Propulsion Laboratory in Southern California.\nAll the signs point to Ingenuity being dead.\nBut there is still one thing, one final trick that can try to reestablish a connection.\nThe first drone that's gonna fly on another planet.\nSix years ago, I visited JPL and saw Ingenuity before she left for Mars.\nAt the time, NASA didn't really believe much in her mission.\nAs Kenneth Farley, the project scientist of the Mars 2020 Perseverance mission said,\nI've personally been opposed to it...\nSpending 30 days working on a technology demonstration does not further the goals directly from the science point of view.\nIn short, they thought it was a waste of time.\nMost projects to Mars get billions of dollars.\nIngenuity got only 80 million, which is less than the budget of the movie The Martian.\nBut this scrappy team of scientists were working to prove a crazy concept.\nAnd against the odds, they made it to Mars.\nOn February 18th, 2021, the Perseverance Rover survives entry and lands on the Martian surface.\nAttached underneath is Ingenuity.\nThis marks Sol Zero, her first day on Mars.\nThey sever the umbilical cord and Ingenuity, affectionately known as Ginny by some on the team, prepares herself.\nHer mission is simple.\nProve that flight on the red planet is possible.\nBut with an atmosphere just 1% that of Earth, flying is really difficult.\nShe must be ultra light, and her blades must spin at over 2,400 rotations per minute to generate enough lift.\nIt's a design that no one is really sure about.\nFor two months, they rigorously check her systems, running up the engine, testing navigation, and her control computer.\nThen, on Sol 58, they finally think they're ready.\nThe blades spin up. And...\nshe takes off, only 120 years after the Wright brothers on Earth.\nHumanity flies on another planet.\nWithin days, they fly again, and then again, and again.\nIn just one month, they complete five flights.\nSo the mission has been accomplished.\nWe were a tech demo, right, meaning a specified, narrow, 30-sol mission.\nUm, get in, get out, we're done, right?\nWe go to a bar and party and that should be the end of it.\nBut with success,\ncomes new expectations.\nNASA tells them to keep going.\nIngenuity's new mission is to assist Perseverance in the search for evidence of ancient life on Mars.\nSo she will scout ahead, gathering data in areas too risky or costly for the rover to explore.\nFor the team, this is great news, but it's also a problem.\n- There was no guarantee, you know, after flight five, we may be dead by flight seven, right?\nWe may be dead by flight 10.\nWe were kind of thrown into the deep end of the pool.\nWe had no processes or no plans developed for such a thing.\nUntil now, every flight had been carefully planned.\nThey've all started from an area selected and analyzed by both satellites and the Perseverance Rover itself.\nThese flights were tested hundreds of times in JPL's wind tunnel, and tens of thousands of times in simulation.\nBut now that they have to keep up with the rover, they're flying into the unknown.\nNow, flying the helicopter isn't easy.\nAt its closest, Mars is 56 million kilometers from Earth. Which means,\nthere's at least a six minute round trip communications time delay,\nwhich is way longer than Ingenuity's two minute maximum flight time.\nSo she has to fly autonomously.\nSo what happens is the pilot programs in a route, and Ginny does the rest.\nBut to start, JPL first needs to know exactly where she's located.\nYou might think that they would use GPS, but for GPS to work on earth, you need at least 24 satellites for full coverage.\nAnd around Mars, there are only seven satellites total, so Ingenuity can't use this method.\nSo instead what she does is far simpler.\nWe have two cameras, a forward facing 13 megapixel camera, and then the one pointing down is the one that we use to navigate.\nThe navigation camera takes 30 black and white images per second.\nIngenuity's computer analyzes the image and identifies features on the surface.\nYou can think of it sort of like an optical mouse.\nLike your optical mouse is on the mouse pad.\nIt doesn't know where on the mouse pad it is, but when you move to the right, it knows you moved to the right.\nBecause what it's doing is it's looking at features on the surface of the mouse pad and watching them move under its field of view.\nSo Ingenuity is essentially doing the same thing.\nIt's looking at the surface, it's picking out features like rocks and other things, and between camera images it says, oh, this rock moved this way, this thing over here moved this way, and from that you can compute a transform,\nto say my helicopter was here and now it's here relative to this image.\nNow this sounds good, but the method isn't 100% reliable.\nOn Flight 6, the first time she leaves her testing area, Ingenuity detects an error.\n54 seconds into the flight, she starts wobbling wildly, tilting 20 degrees at a time.\nHer emergency alarms blare.\nWe had black and white image, black and white image, black and white image, and we had a colored image come very closely to where that black and white image occurred in time.\nThis color camera was added late in development, leaving little time for testing.\nAnd during this flight, one of the images arrives at the exact same moment as a black and white image.\nThe system doesn't know what to do, so it drops the black and white image.\nThis makes every following image one step behind.\nThis means Ingenuity's cameras are giving her outdated information.\nSo even when she's in the right spot, the computer thinks she's lagging behind and pushes her forward.\nSo she overshoots, tilts too far, and then has to overcorrect in the other direction.\nThis cycle repeats, making her wobble worse in a positive feedback loop.\nNow that is a problem, but it isn't fatal.\nThe desyncing issue was like one camera frame off.\nIf it had been more than that, I think you can imagine.\nimagine that it might have death spiraled.\nInstead, Ginny detects the problem and is able to emergency land before it gets too ugly.\nWhile safely on the ground, JPL discovers the error and quickly corrects it with a software patch.\nIt's a close call, but they recover.\nOver the next dozen flights, they keep up with the rover and support the mission.\nThat is, until Flight 19.\nWe were about to fly that 19th flight, and I got a phone call the afternoon before, basically saying there's a dust storm brewing near Jezero crater.\nSo we quickly canceled the flight and said well we're just going to hunker down and see what happens.\nThey brace for impact.\nIt lasts six days, with winds gusting up to 20 meters per second.\nThat first dust storm in the middle of fall, the first Martian year that we were on the surface, it clobbered us.\nBut... they make it through.\nNervously, they try to make contact, and she survived.\nShe hasn't died or toppled over, but now they have a new problem. Dust.\nDust on Mars is no joke.\nI mean, for Ginny, there are two big problems.\nFirst, dust is covering her solar panels, reducing power by 18%.\nAnd second, it's clogging her mechanical components.\nWe went to go fly, and when we went to wiggle the servos, they were actually stuck.\nThey were kind of jammed from the dust.\nSo that aborted the first attempt at flight 19.\nNow JPL had anticipated both of these problems, but they hadn't had the time or budget to fix them.\nSo for the first, they just have to accept that they have reduced solar power and they adjust their flight durations accordingly.\nFor the second, they find a workaround by repeatedly wiggling the servos until the joints clear.\nSo she's able to keep flying, albeit wounded, and survival isn't getting any easier.\nSee, every Martian night, the temperature drops precipitously.\nMy friend Alex from the channel Astrum describes it well.\nWith less atmosphere, Mars became far worse at retaining heat.\nWhen the surface starts to cool, there is no air to catch the escaping warmth.\nIt is at the point where, if you were to stand on the planet's equator during its warmest time of the day, your feet might feel 23°C, while at your head, it would be 0°C.\nThis means between day and night, Mars has some intense temperature swings.\nTemperatures there now range from highs of around 27°C down to a freezing minus 133°C at night.\nIf you want to learn more about how this leads to entire planet-covering dust storms, Astrum has a whole video on the Martian climate.\nSo these massive shifts in temperature are happening all the time.\nBut as Ginny's mission progresses, Mars gets farther away from the Sun and enters the Martian winter.\nSo it gets even colder at night, which is a problem.\nMany of Ingenuity's key electrical components are hand-soldered.\nAnd big temperature swings cause expansion and contraction of this metal, and so that can eventually break these connections.\nAlso, inside the batteries, a liquid electrolyte solution allows lithium ions to move between the cathode and anode during charging and discharging.\nBut if this solution freezes, JPL fears that the whole thing will stop working entirely.\nSo what they do is keep all the components sensitive to the cold inside a warm box, which has resistance heaters that run during the night.\nYou might spend 25 or 30% of your battery flying and the other 60 to 75% is all just staying warm at night.\nThe problem is, the colder it gets, the harder the heaters have to work.\nAnd if they can't keep up, and the batteries cool too much, they become less efficient.\nSo they supply even less power to the heaters.\nPerformance can continue to degrade in a vicious death spiral.\nOn the morning of May 3rd, the team at JPL goes about a normal day.\nThey check the data from the previous downlink?\nNothing.\nThey try pinging ingenuity?\nStill nothing.\nHave they finally lost her?\nDid we just lose our $70 million helicopter on Mars?\nIs this the end of the mission?\nWe thought this was it.\nSo let's just make sure, before we close the door on ingenuity, we've thought of everything.\nJust keep working through it.\nThey run through all the possible problems until they narrow it down to just one.\nThe way she was designed, Ginny has an alarm clock that wakes her up.\nIt stays awake for 15 minutes.\nIf it doesn't hear anything after 15 minutes, it goes back to sleep, and it doesn't wake up until the next alarm.\nTheir hypothesis is this:\nif the lack of sunlight forced Jenny to fully deplete her batteries, then during the night her heaters would have stopped and she would have powered off completely.\nWhen the sun rises, as long as her essential components still function, she may recharge enough to wake up.\nOnly now her clock will have reset.\nSo they run the calculations.\nIf she's still alive based on when the sun comes up, she should be waking up at 11:45 a.m.\nMartian time.\nThat is not the time they had been trying.\nSo they change their search window and start calling out to Ginny around when they expect her to power up.\nThey send out ping after ping until finally...\nshe's alive!\nThey check to see whether everything is still working.\nAnd despite the components in her warm box only being rated to negative 45 degrees, they survive being completely frozen.\nWell, all except for one.\nThe inclinometer is dead.\nThe inclinometer is what lets Ingenuity know her physical orientation in 3D space before flight.\nAnd that is pretty essential for getting the right heading.\nYou can imagine if you're off in heading by 10 degrees, you could fly into a mountain.\nWithout the inclinometer, there is no way for her to fly.\nSo at first, the whole team is stumped, but then they have an idea because Ingenuity is made of phone parts, literally parts from phones people carry around every day.\nHer processor is from a Samsung Galaxy S5, and some of her sensors are from a Google Pixel 3.\nAnd these phones can do a lot of the things that an inclinometer can do.\nInside every smartphone are at least three little micro-electromechanical systems aligned perpendicular to each other, like x, y, z.\nAt their core is a small mass suspended by flexible arms.\nThey work like springs and follow Hooke's law, F = -kx, where force is proportional to displacement.\nThe mass also follows Newton's second law, F = ma.\nIf you combine these equations, you get a = -kx/m.\nwhich links acceleration and displacement.\nSurrounding the mass are fixed arms.\nWhen a voltage is applied to the mass and arms, they form a capacitor, where epsilon and A stay constant, but as the mass moves, the distance between them changes with x.\nThis alters the capacitance, which becomes more noticeable with multiple plates, hence why they have so many little arms.\nBy measuring capacitance, you can determine displacement.\nAnd since displacement is proportional to acceleration, changes in capacitance allow us to measure acceleration.\nThat's why these devices are called accelerometers, and by integrating acceleration over time, you can work out velocity and then position.\nThis is how motion tracking works for screen rotation, gaming controls, and step counting.\nIf you add gyroscopes, you get an inertial measurement unit, or IMU, and Ingenuity has the same IMU as the Google Pixel 3.\nSo the team at JPL had an idea.\nThey could reprogram the computer to use the IMU to replace the inclinometer.\nThe inclinometer is really just accelerometers that allows us to tell the initial altitude of the vehicle in roll and pitch.\nAnd the IMU also has accelerometers, so in principle it gives you the same information.\nSo from the clutches of failure, they get her running again.\nWe got lucky in that the one instrument we could afford to lose was the one that died.\nBut the IMU isn't space-grade.\nIn fact, none of these off-the-shelf parts are, which means they're vulnerable to cosmic rays.\nOn Mars, the thin atmosphere doesn't just make it harder to fly.\nIt also means cosmic rays reach the surface more easily, and a single cosmic ray can strike a computer register and flip a bit inside the computer, which can lead to some strange behavior.\nIt even happens here on Earth.\nIt once added 4,096 unaccounted votes to a candidate in a Belgian election.\nNow on a Martian helicopter, flipping the wrong bit at the wrong time could mean losing control and crashing.\nSo why doesn't that happen? \nIf you'd asked\nsomebody 10 years ago can you fly just the latest cell phone processor they'd be like no it'll last like two days and you'll be dead right\nIt turns out that cosmic ray bit flips are not as big a deal as NASA thought.\nThe off-the-shelf components hold up way better than they expected.\nAnd this is an important finding.\nRather than going through all of the development cost of building up a processor from scratch to be radiation tolerant,\nour finding is you get a lot better bang for your buck by just going and basically buying batches of different processors and just qualling them.\nThat means throw them through a radiation test campaign, look at the failure rates, figuring out,\nhey, this guy, we don't know why, but for whatever reason, this processor over here is great.\nIt holds up, so we'll fly that.\nNow, using these surprisingly robust off-the-shelf parts, they survive the rest of the winter,\nbut they're only barely able to stay within the communication range of the rover.\n-Springtime came.\n-Yeah.\n-The birds were chirping on the...\n-Talk about spring optimism, right?\nLike coming out of winter.\nWith the increased sunlight, they can now fully recharge and return to their scientific mission.\nOver the next 41 flights, they image craters Perseverance can't make it to.\nThey capture stunning images of the Martian horizon from above.\nthey conduct daring aerodynamic tests and they begin to push the limits.\nThey want to fly faster, but the faster they go, the quicker features move across the camera's field of view.\nAnd the vision navigation system just can't keep up with that.\nSo JPL comes up with a solution.\nThey fly higher.\nThen they can expand the field of view, which means features will move more slowly through frame.\nSo, from an initial goal of a 10 meter altitude, they go up to 24 meters, and as a result,\nthey're able to go from flying at 2 meters per second all the way up to 10 meters per second.\nSpeed records, distance records, altitude records, just everything we could think of to push that flight envelope on Ingenuity,\nreally make the most of this once-in-a-lifetime opportunity of having a helicopter on Mars.\nEverything is going swimmingly.\nGinny and Perseverance have made it all the way to Nuretva Vallis, a river delta in Jezero Crater.\nBut on Flight 71, there's a new problem, and it's worse than any of the ones that came before.\nNow, Ingenuity's only scientific payload is a camera, so she's taking hundreds of photos a day and sending them to JPL.\nAnd she's not alone.\nPerseverance does the same, including this selfie with Ingenuity.\nHonestly, they're the most chronically online duo on Mars.\nWe always know exactly where they are, what they're up to, and they're constantly sharing photos.\nBut really, how different is that from us?\nI mean, we spend most of our lives online, constantly sharing data.\nExcept in our case, that data doesn't just sit in a NASA archive.\nIt gets bought, sold, and used in ways we're not always aware of.\nThat's why I've been using today's sponsor, Incogni.\nI created my account a year ago, and since then they've filed over 300 requests on my behalf,\nresulting in my data being removed from over 100 marketing and spam databases.\nIf I tried to do that myself, it would have taken around 230 hours, literally weeks of work.\nThat is time I can better spend making videos, which I'm sure you appreciate.\nSo to try Incogni, visit incogni.com/veritasium.\nI'll put that link down in the description or you can scan this QR code.\nAnd when you do make sure to use code Veritasium to get 60% off your annual subscription.\nSo head over to incogni.com/veritasium and protect your online data today.\nI want to thank Incogni for sponsoring this part of the video.\nAnd now back to Ingenuity.\nSo we just had this one final thing to do.\nWe needed to cross this sand dune and make it to Bright Angel to rendezvous with the rover.\nSo on 71, we basically went up.\nWe were flying.\nAnd then after about 10 seconds of flying with degraded navigation, we went into an emergency landing mode and sort of came down hard.\nThey hailed Ginny and luckily she's still alive.\nIn the error code they discover the problem.\nAs she was flying over the dunes there just weren't enough rocks or landmarks for her camera to identify\nand without those references she quickly lost track of her position and had to make an emergency landing.\nIt's similar to the camera issue from flight 6 but this time there's no software fix.\nThey check for structural damage\nbut suprisingly everything is still intact.\nSo they attempt another flight, this time going straight up to scan the surroundings and then coming straight back down. Simple.\nWe popped up, took pictures, and then on the way back down, we hit the same problems we did on 71.\nOnly this time, it's fatal.\nPerseverance drives over and captures this image of her crash site.\nWhen we saw the blades broken, when we saw that first image after flight 72, that was heart wrenching.\nIt was like, no, there's no way this mission can continue.\nThat was very depressing.\nSo why?\nBecause 71 was also a crash landing for the same reasons.\nIt was, you know, the NASA system was confused and drove us into the ground, but we came out of that apparently unscathed, and yet on 72, we self-destructed.\nThis is the first air crash investigation on another planet, right?\nYeah, that's right.\nFirst aircraft on another planet and then the first air crash investigation kind of go hand in hand.\nAt the crash site, they find Ingenuity's blades scattered, but not in the way they expect.\nWe noticed something interesting, which was there was no blade strike spot.\nBlades spinning this fast, when they hit the ground, right, they're going to create a spray.\nThere's going to be a pattern, probably even visible from orbit, and we didn't see anything like that.\nSo if the blades didn't strike the ground, then what happened?\nSo this is an actual prototype blade from the development phase.\nThis is essentially identical to the blades on Ingenuity.\nIt's a carbon fiber composite with a foam core.\nIt's incredibly light, if you want to feel it.\nYeah.\n- Woah! \nThat's actually great.\nThat's like at least a quarter of what I expected just looking at it.\nIt doesn't feel physical.\nSo why did they break?\nWell, as the blades spin, the tips of the blades trace out a circle, which you can think of like a hula hoop.\nIf there's a force up on the near side, you might expect the rotor to tilt immediately in this direction.\nBut that is not actually what happens.\nSee, the blade isn't stationary, it's moving really fast.\nSo when you apply this force, it actually only moves after that point.\nSo the maximum displacement occurs 90 degrees later.\nSo, even though we push up on the near side, the blades tilt up on the right and down on the left.\nThis effect is called precession, and it's the same principle that explains this spinning bike wheel demonstration.\nNow, Ingenuity has a second set of blades that are moving in the opposite direction.\nWhich means that, when a force is applied, each set of blades experiences precession in the opposite direction.\nFor the helicopter overall, these torques cancel out,\nbut each individual blade still flexes because of that precession torque.\nThat results in a stress concentration right about here where that final reinforcement tapers off.\nAnd so if you had a procession-based failure, you'd expect it to fail right here.\nAnd sure enough, that's exactly where you see it in the pictures.\nYou can see sort of this jaggy place where the blade tip just got ripped off.\nSo that is what happened on Flight 72.\nAs Ginny came down hard, she hit a dune at an angle.\nThe force was transmitted up through the body of the helicopter, and this created a procession torque that bent the rotors, and they snapped right where the reinforcement tapers down.\nThis thing came down hard.\nIt didn't destroy the landing gear.\nIt didn't break the avionics.\nIt didn't kill the servos.\nThe swash plates are all fine.\nThey're all intact.\nIt's the rotors.\nThat's the weak link.\nSo that is the first thing they're changing on the next generation of Mars helicopter, which is called Chopper.\nYou had a chance to hold the Ingenuity blade.\nThis is the next-gen baby blade.\nIt looks fairly similar with a couple of key differences.\nThey reinforced the blades to withstand the torques caused by hard landings.\nNow they also have six rotors instead of two, which means Chopper can hold a lot, even carrying a scientific payload of its own.\nWe've developed now a very lightweight radio that can communicate directly to orbit.\nWoah.\nSo we're a free bird when it comes to exploring the planet now.\n-That's huge, that's huge!\nYou were sort of trying to trail perseverance, right, and now you can go anywhere.\nYep, we're our own spacecraft.\nIn this blue box, you can shove about five kilograms of science payload and bring it anywhere on the planet on Mars.\nYou can fly three kilometers per sol in a matter of minutes.\nThat's really generated a lot of excitement in the science community.\nSo this is a fifth scale model of Chopper.\nIt's really two systems.\nSo this is our Chopper platform, right?\nThis is what's going to go on and explore the entire surface of Mars one day.\nThat's the point of the concept.\nBut underneath,\nis a mid-air helicopter delivery platform.\nSee, Mars rovers all need complex sky cranes to land, but a helicopter is different.\nIt just needs a platform to take off from.\nSo the idea is we come down through the atmosphere, we have this jet pack that we need to slow us down to get us down to a regime that is controllable\nso that we can take off from that platform midair and land under our own power.\nFor this, it needs rockets.\n3, 2, 1...\nAwesome! \nYou're envisioning like a future of aviation all over Mars as a primary explorative.\nIn my mind, it's absolutely going to happen in just a matter of time.\nThere will be fleets flying, you know, throughout Mars.\nThere will be airports on Mars one day, and we'll have aircraft the size of Chopper, more aircraft the size of Ingenuity, and even bigger than Chopper.\nNASA is thinking big thanks to Ingenuity, a project they once doubted.\nBecause Ginny showed what is possible.\nIn 1890, if you had said, I'm gonna fly, it's like, okay, that kooky guy in his garage, he thinks he can fly, he's gonna kill himself, right?\nAfter the Wright brothers, it's like, oh, okay, yeah, this is the thing that we're gonna do.\nAnd so that's the change in mentality that's occurred because of engineering.\nThat's why, still sitting there on the surface of Mars, attached to the underside of Ingenuity is a tiny scrap, one square centimeter of muslin fabric.\nIt was taken from the lower left wing of the first airplane, the right flyer.\nFrom the first flight on Earth, to the first flight on another planet.\nFrom Ingenuity's grave on Mars, her spirit lives on.\nExcept...\nshe isn't quite dead yet.\nShe's acting as a weather station now, capturing photos every day, capturing temperature measurements every day, something no one would\nhave ever predicted before flight 72 that if things don't go well, we just still have a functioning spacecraft.\nSo she's a tank.\nThe team couldn't be more proud of what Ingenuity's accomplished.\nThanks for watching."
}